#pragma once

#include "p30h_regTypeDef.hpp"

namespace reg
{
    /**
    * Едмомерен масив от елементи от тип RegisterRead.
    */
    RegisterRead reg_map[]
    {
        // Стандартни параметри
        {"Напрежение", "U", "V", REG_FLOAT32, 6000, 7000, true},
        {"Ток", "I", "A", REG_FLOAT32, 6002, 7002, true},
        {"Мощност", "P", "W", REG_FLOAT32, 6004, 7004, true},
        {"Измерената промяна на напрежение за интервал от време (по подразбиране: 5 секунди)", "dU", "V", REG_FLOAT32, 6006, 7006, true},
        {"Измерената Промяна на ток за интервал от време (по подразбиране: 5 секунди)", "dI", "A", REG_FLOAT32, 6008, 7008, true},
        {"Капацитет", "C", "Ah", REG_FLOAT32, 6014, 7014, true},
        {"Средна измерена мощност", "P_avg", "W", REG_FLOAT32, 6016, 7016, true},
        {"Средно измерено напрежение", "U_avg", "V", REG_FLOAT32, 6018, 7018, true},
        {"Среден измерен ток", "I_avg", "A", REG_FLOAT32, 6020, 7020, true},
        {"Температура", "T", "Degrees Celsius", REG_FLOAT32, 6028, 7028, true},
        // Енергийни стойности
        {"Внесена енергия", "E_in", "Wh", REG_FLOAT32, 6030, 7030, true},
        {"Изнесена енергия", "E_out", "Wh", REG_FLOAT32, 6032, 7032, true},
        {"Обща енергия", "E_total", "Wh", REG_FLOAT32, 6034, 7034, true},
        {"Разлика в енергията", "E_diff", "Wh", REG_FLOAT32, 6038, 7038, true},
        {"Брояч на капацитет", "C_counter", "Ah", REG_FLOAT32, 6036, 7036, true},
        // Минимално/максимално измерени стойности
        {"Минимално напрежение", "U_min", "V", REG_FLOAT32, 6064, 7064, true},
        {"Максимално напрежение", "U_max", "V", REG_FLOAT32, 6066, 7066, true},
        {"Минимален ток", "I_min", "A", REG_FLOAT32, 6068, 7068, true},
        {"Максимален ток", "I_max", "A", REG_FLOAT32, 6070, 7070, true},
        {"Минимална мощност", "P_min", "W", REG_FLOAT32, 6072, 7072, true},
        {"Максимална мощност", "P_max", "W", REG_FLOAT32, 6074, 7074, true},
        {"Минимална промяна на напрежение", "dU_min", "V", REG_FLOAT32, 6076, 7076, true},
        {"Максимална промяна на напрежение", "dU_max", "V", REG_FLOAT32, 6078, 7078, true},
        {"Минимална промяна на ток", "dI_min", "A", REG_FLOAT32, 6080, 7080, true},
        {"Максимална промяна на ток", "dI_max", "A", REG_FLOAT32, 6082, 7082, true},
        {"Минимален капацитет", "C_min", "Ah", REG_FLOAT32, 6092, 7092, true},
        {"Максимален капацитет", "C_max", "Ah", REG_FLOAT32, 6094, 7094, true},
        {"Средна минимална мощност", "P_avg_min", "W", REG_FLOAT32, 6096, 7096, true},
        {"Средна максимална мощност", "P_avg_max", "W", REG_FLOAT32, 6098, 7098, true},
        {"Средно минимално напрежение", "U_avg_min", "V", REG_FLOAT32, 6100, 7100, true},
        {"Средно максимално напрежение", "U_avg_max", "V", REG_FLOAT32, 6102, 7102, true},
        {"Среден минимален ток", "I_avg_min", "A", REG_FLOAT32, 6104, 7104, true},
        {"Среден максимален ток", "I_avg_max", "A", REG_FLOAT32, 6106, 7106, true},
        {"Минимална температура", "T_min", "Degrees Celsius", REG_FLOAT32, 6120, 7120, true},
        {"Максимална температура", "T_max", "Degrees Celsius", REG_FLOAT32, 6122, 7122, true}
    };

    /**
    * Константа, която съдържа броя на елементите в reg_map
    */
    const size_t reg_count = sizeof(reg_map) / sizeof(reg_map[0]);
};
